src/Documents/ЗаказНаряд/ЗаказНаряд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаряд</name>
  <registerRecords>AccumulationRegister.МатериалыЗаказчиков</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыКлиентов</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаказа</name>
    <type>
      <types>EnumRef.СостоянияЗаказовНарядов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемыЗаказчиком</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемыМастером</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыЗаказчика</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеМатериала</name>
      <type>
        <types>EnumRef.СостояниеМатериаловКлиента</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ЗаказНаряд/ManagerModule.bsl
// Модуль менеджера документа "ЗаказНаряд".
// Содержит процедуру формирования печатной формы "Заказ-Наряд".

// Печатная форма "Заказ-Наряд"
// Параметры:
//   ТабДок  - ТабличныйДокумент - ТабличныйДокумент, в который выводится готовая печатная форма.
//   Ссылка  - ДокументСсылка.ЗаказНаряд - Массив - документ или массив документов для печати.
// Описание:
//   На основе макета "Заказ-Наряд" и запроса, получающего данные документа,
//   формируется готовая печатная форма с выводом услуг и материалов заказчика.
//   Для каждой ссылки (документа) выводится отдельный блок с заголовком, шапкой,
//   табличными частями и подвалом (итоговая сумма прописью).
//   Документы разделяются горизонтальной линией.
#Область ПрограммныйИнтерфейс
Процедура ЗаказНаряд(ТабДок, Ссылка) Экспорт
    //{{_КОНСТРУКТОР_ПЕЧАТИ(Заказ-Наряд)
    // Данный фрагмент построен конструктором печати.
    // При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
    
    // Получаем макет печатной формы.
    Макет = ПолучитьМакет("Заказ-Наряд");
    
    // Запрос для получения данных документа, включая вложенные табличные части.
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |    ЗаказНаряд.Автомобиль КАК Автомобиль,
    |    ЗаказНаряд.ДатаЗаписи КАК ДатаЗаписи,
    |    ЗаказНаряд.Клиент КАК Клиент,
    |    ЗаказНаряд.ОписаниеПроблемыЗаказчиком КАК ОписаниеПроблемыЗаказчиком,
    |    ЗаказНаряд.ОписаниеПроблемыМастером КАК ОписаниеПроблемыМастером,
    |    ЗаказНаряд.Ответственный КАК Ответственный,
    |    ЗаказНаряд.Склад КАК Склад,
    |    ЗаказНаряд.Сотрудник КАК Сотрудник,
    |    ЗаказНаряд.СуммаДокумента КАК СуммаДокумента,
    |    ЗаказНаряд.Услуги.(
    |        НомерСтроки КАК НомерСтроки,
    |        Услуга КАК Услуга,
    |        Количество КАК Количество,
    |        Цена КАК Цена,
    |        Сумма КАК Сумма
    |    ) КАК Услуги,
    |    ЗаказНаряд.МатериалыЗаказчика.(
    |        НомерСтроки КАК НомерСтроки,
    |        Номенклатура КАК Номенклатура,
    |        СостояниеМатериала КАК СостояниеМатериала,
    |        Количество КАК Количество
    |    ) КАК МатериалыЗаказчика,
    |    ЗаказНаряд.Номер КАК Номер,
    |    ЗаказНаряд.Дата КАК Дата
    |ИЗ
    |    Документ.ЗаказНаряд КАК ЗаказНаряд
    |ГДЕ
    |    ЗаказНаряд.Ссылка В(&Ссылка)";
    Запрос.Параметры.Вставить("Ссылка", Ссылка);
    Выборка = Запрос.Выполнить().Выбрать();
    
    // Инициализация областей макета.
    ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
    Шапка = Макет.ПолучитьОбласть("Шапка");
    ОбластьУслугиШапка = Макет.ПолучитьОбласть("УслугиШапка");
    ОбластьУслуги = Макет.ПолучитьОбласть("Услуги");
    ОбластьМатериалыЗаказчикаШапка = Макет.ПолучитьОбласть("МатериалыЗаказчикаШапка");
    ОбластьМатериалыЗаказчика = Макет.ПолучитьОбласть("МатериалыЗаказчика");
    Подвал = Макет.ПолучитьОбласть("Подвал");
    
    // Очистка табличного документа перед заполнением.
    ТабДок.Очистить();
    
    ВставлятьРазделительСтраниц = Ложь;
    Пока Выборка.Следующий() Цикл
        // Между документами вставляем горизонтальный разделитель страниц.
        Если ВставлятьРазделительСтраниц Тогда
            ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        
        // Заголовок с номером и датой.
        ОбластьЗаголовок.Параметры.Номер = Выборка.Номер;
        ОбластьЗаголовок.Параметры.Дата = Формат(Выборка.Дата, "ДЛФ=DD.MM.YYYY");
        ТабДок.Вывести(ОбластьЗаголовок);
        
        // Шапка документа (основные реквизиты).
        Шапка.Параметры.Заполнить(Выборка);
        ТабДок.Вывести(Шапка, Выборка.Уровень());
        
        // --- Табличная часть "Услуги" ---
        ТабДок.Вывести(ОбластьУслугиШапка);
        ВыборкаУслуги = Выборка.Услуги.Выбрать();
        Пока ВыборкаУслуги.Следующий() Цикл
            ОбластьУслуги.Параметры.Заполнить(ВыборкаУслуги);
            ТабДок.Вывести(ОбластьУслуги, ВыборкаУслуги.Уровень());
        КонецЦикла;
        
        // --- Табличная часть "Материалы заказчика" ---
        ТабДок.Вывести(ОбластьМатериалыЗаказчикаШапка);
        ВыборкаМатериалыЗаказчика = Выборка.МатериалыЗаказчика.Выбрать();
        Пока ВыборкаМатериалыЗаказчика.Следующий() Цикл
            ОбластьМатериалыЗаказчика.Параметры.Заполнить(ВыборкаМатериалыЗаказчика);
            ТабДок.Вывести(ОбластьМатериалыЗаказчика, ВыборкаМатериалыЗаказчика.Уровень());
        КонецЦикла;
        
        // Подвал с итоговой суммой и расшифровкой прописью.
        Подвал.Параметры.Заполнить(Выборка);
        СуммаДокумента = Выборка.СуммаДокумента;
        ФормСтрока = "Л = ru_RU; ДП = Истина";
        ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2";
        Подвал.Параметры.СуммаПрописью = ЧислоПрописью(СуммаДокумента, ФормСтрока, ПарПредмета);
        ТабДок.Вывести(Подвал);
        
        // Следующие документы будут разделены.
        ВставлятьРазделительСтраниц = Истина;
    КонецЦикла;
    //}}__КОНСТРУКТОР_ПЕЧАТИ
КонецПроцедуры
#КонецОбласти
